stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/mc_can.c
/*

 This file is part of the OOBD.org distribution.

 OOBD.org is free software; you can redistribute it and/or modify it
 under the terms of the GNU General Public License (version 2) as published
 by the Free Software Foundation and modified by the FreeRTOS exception.

 OOBD.org is distributed in the hope that it will be useful, but WITHOUT
 ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 more details.

 You should have received a copy of the GNU General Public License along
 with FreeRTOS.org; if not, write to the Free Software Foundation, Inc., 59
 Temple Place, Suite 330, Boston, MA  02111-1307  USA.


 OOBD C source files requirement:
 Unix EOL file format
 UTF-8
 formated with "indent -kr"

 Please ensure to read the configuration and relevant port sections of the
 online documentation.


 OOBD is using FreeRTOS (www.FreeRTOS.org)

 */

/**
 * MC specific CAN routines
 */

#include "stm32f10x.h"

/* OOBD headers. */
#include "SystemConfig.h"
#include "od_base.h"
#include "od_protocols.h"
#include "odb_can.h"
#include "mc_can.h"
#include "mc_sys.h"

extern char *oobd_Error_Text_OS;
extern struct CanConfig *canConfig;

/* callback function for received data */
recv_cbf reportReceivedData = NULL;

UBaseType_t rxCount;
UBaseType_t txCount;
UBaseType_t errCount;
UBaseType_t stCANBusOffErr;
UBaseType_t stCANBusWarningErr;
UBaseType_t stCANBusPassiveErr;
UBaseType_t ctrCANTec;
UBaseType_t ctrCANRec;

UBaseType_t bus_init_can()
{
    NVIC_InitTypeDef NVIC_InitStructure;
    extern startupProtocol;

    rxCount = 0;
    txCount = 0;
    errCount = 0;
    stCANBusOffErr = 0;
    stCANBusWarningErr = 0;
    stCANBusPassiveErr = 0;
    ctrCANTec = 0;
    ctrCANRec = 0;

    canConfig = pvPortMalloc(sizeof(struct CanConfig));
    if (canConfig == NULL) {
	DEBUGPRINT("Fatal error: Not enough heap to allocate CanConfig!\n",
		   'a');
	return pdFAIL;
    }
    canConfig->bus = VALUE_BUS_MODE_SILENT;	/* default */
    canConfig->busConfig = VALUE_BUS_CONFIG_11bit_500kbit;	/* default */

    /* Enable CAN1 Transmit interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = USB_HP_CAN1_TX_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable CAN1 Receive interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable CAN1 Receive error interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = CAN1_SCE_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    return pdPASS;
}


/*----------------------------------------------------------------------------*/

void CAN_GetCanConfig(struct CanConfig *canConfig){

	    DEBUGUARTPRINT("\r\n*** CAN_GetCanConfig NOT proberly implemented for STM32 yet! ***");

/*
	
	int mystate = CAN_STATE_STOPPED;
    int error= can_get_state(canChannel[iCanBusIndex], &mystate);
    if (error){
	    canConfig->state=STATE_REQUEST_CAN_UNKNOWN;
    }else{
	switch (mystate) {
		case CAN_STATE_ERROR_ACTIVE:
			canConfig->state=STATE_REQUEST_CAN_ERROR_ACTIVE;
		break;
		case CAN_STATE_ERROR_WARNING:
			canConfig->state=STATE_REQUEST_CAN_ERROR_WARNING;
		break;
		CAN_STATE_ERROR_PASSIVE:
			canConfig->state=STATE_REQUEST_CAN_ERROR_PASSIVE;
		break;
		CAN_STATE_BUS_OFF:
			canConfig->state=STATE_REQUEST_CAN_BUS_OFF;
		break;
		CAN_STATE_STOPPED:
			canConfig->state=STATE_REQUEST_CAN_STOPPED;
		break;
		CAN_STATE_SLEEPING:
			canConfig->state=STATE_REQUEST_CAN_SLEEPING;
		break;
		default:
			canConfig->state=STATE_REQUEST_CAN_UNKNOWN;
		break;
	}
    }
    
   struct can_ctrlmode cm;
    error= can_get_ctrlmode(canChannel[iCanBusIndex], &cm);
    if (error){
	    canConfig->mode=VALUE_BUS_MODE_SILENT;
    }else{
	if (  cm.mask == ( CAN_CTRLMODE_LOOPBACK | CAN_CTRLMODE_LISTENONLY ) && cm.flags == CAN_CTRLMODE_LISTENONLY )
	{
		canConfig->mode= VALUE_BUS_MODE_SILENT;
	} else {
		if ( cm.mask == ( CAN_CTRLMODE_LOOPBACK | CAN_CTRLMODE_LISTENONLY ) && cm.flags == CAN_CTRLMODE_LOOPBACK )
		{
			canConfig->mode= VALUE_BUS_MODE_LOOP_BACK;
		} else {
			if ( cm.mask == ( CAN_CTRLMODE_LOOPBACK | CAN_CTRLMODE_LISTENONLY ) &&  cm.flags == ( CAN_CTRLMODE_LOOPBACK | CAN_CTRLMODE_LISTENONLY ) )
			{
				canConfig->mode= VALUE_BUS_MODE_LOOP_BACK_WITH_SILENT;
			} else {
				if ( cm.mask == ( CAN_CTRLMODE_LOOPBACK | CAN_CTRLMODE_LISTENONLY ) && cm.flags == 0 )
				{
					canConfig->mode= VALUE_BUS_MODE_NORMAL;
				}
			}
		}
	}
    }

     struct can_bittiming bt ;
    error= can_get_bittiming(canChannel[iCanBusIndex], &bt);
    if (error){
	    canConfig->busConfig=VALUE_BUS_CONFIG_11bit_500kbit;
    }else{
	switch (bt.bitrate) {
		case 125000:
			canConfig->busConfig=VALUE_BUS_CONFIG_11bit_125kbit;
		break;
		case 250000:
			canConfig->busConfig=VALUE_BUS_CONFIG_11bit_250kbit;
		break;
		case 500000:
			canConfig->busConfig=VALUE_BUS_CONFIG_11bit_500kbit;
		break;
		case 1000000:
			canConfig->busConfig=VALUE_BUS_CONFIG_11bit_1000kbit;
		break;
		default:
			canConfig->busConfig=VALUE_BUS_CONFIG_11bit_500kbit;
		break;
	}
    }
*/
}

/*----------------------------------------------------------------------------*/

UBaseType_t bus_send_can(data_packet * data)
{

    DEBUGUARTPRINT("\r\n*** bus_send_can entered! ***");

    CanTxMsg TxMessage;

    if (canConfig->busConfig == VALUE_BUS_CONFIG_29bit_125kbit
	|| canConfig->busConfig == VALUE_BUS_CONFIG_29bit_250kbit
	|| canConfig->busConfig == VALUE_BUS_CONFIG_29bit_500kbit
	|| canConfig->busConfig == VALUE_BUS_CONFIG_29bit_1000kbit) {
	TxMessage.ExtId = data->recv;	/* Extended CAN identifier 29bit */
	TxMessage.IDE = CAN_ID_EXT;	/* IDE=1 for Extended CAN identifier 29 bit */
    } else {
	TxMessage.StdId = data->recv;	/* Standard CAN identifier 11bit */
	TxMessage.IDE = CAN_ID_STD;	/* IDE=0 for Standard CAN identifier 11 bit */
    }

    TxMessage.RTR = CAN_RTR_DATA;	/* Data frame */
    TxMessage.DLC = data->len;	/* Data length code */

    TxMessage.Data[0] = data->data[0];
    TxMessage.Data[1] = data->data[1];
    TxMessage.Data[2] = data->data[2];
    TxMessage.Data[3] = data->data[3];
    TxMessage.Data[4] = data->data[4];
    TxMessage.Data[5] = data->data[5];
    TxMessage.Data[6] = data->data[6];
    TxMessage.Data[7] = data->data[7];

