stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/mc_can.c
	    /* CAN filter mask ID reconfig */
	    if (args->args[ARG_VALUE_1] == 1 ||
		args->args[ARG_VALUE_1] == 3 ||
		args->args[ARG_VALUE_1] == 5 ||
		args->args[ARG_VALUE_1] == 7 ||
		args->args[ARG_VALUE_1] == 9) {
		CAN_FilterInitStructure.CAN_FilterMaskIdLow =
		    (uint16_t) args->args[ARG_VALUE_2] << 5;
		CAN_FilterInitStructure.CAN_FilterMaskIdHigh =
		    (uint16_t) (CAN1->sFilterRegister
				[CAN_FilterInitStructure.CAN_FilterNumber].
				FR2 >> 16 & 0x0000FFFF);
	    } else {
		CAN_FilterInitStructure.CAN_FilterMaskIdLow =
		    (uint16_t) (CAN1->sFilterRegister
				[CAN_FilterInitStructure.CAN_FilterNumber].
				FR1 >> 16 & 0x0000FFFF);
		CAN_FilterInitStructure.CAN_FilterMaskIdHigh =
		    (uint16_t) args->args[ARG_VALUE_2] << 5;
	    }
	    CAN_FilterInitStructure.CAN_FilterIdLow =
		(uint16_t) (CAN1->sFilterRegister
			    [CAN_FilterInitStructure.CAN_FilterNumber].FR1
			    & 0x0000FFFF);
	    CAN_FilterInitStructure.CAN_FilterIdHigh =
		(uint16_t) (CAN1->sFilterRegister
			    [CAN_FilterInitStructure.CAN_FilterNumber].FR2
			    & 0x0000FFFF);
	    CAN_FilterInitStructure.CAN_FilterScale =
		CAN_FilterScale_16bit;
	    CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	    CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	    CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	    CAN_FilterInit(&CAN_FilterInitStructure);
	    createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0,
				   NULL);
	} else {
	    createCommandResultMsg(FBID_BUS_SPEC,
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED,
				   args->args[ARG_VALUE_2],
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED_TEXT);
	}
	break;

    case PARAM_BUS_Can29MaskID:	/* 29bit CAN filter mask ID reconfig */
	CAN_FilterInitStructure.CAN_FilterNumber =
	    args->args[ARG_VALUE_1] - 1;
	CAN_FilterInitStructure.CAN_FilterIdLow =
	    (uint16_t) (CAN1->sFilterRegister
			[CAN_FilterInitStructure.CAN_FilterNumber].FR1 &
			0x0000FFFF);
	CAN_FilterInitStructure.CAN_FilterIdHigh =
	    (uint16_t) (CAN1->sFilterRegister
			[CAN_FilterInitStructure.CAN_FilterNumber].FR1 >>
			16 & 0x0000FFFF);
	CAN_FilterInitStructure.CAN_FilterMaskIdLow =
	    (uint16_t) (args->args[ARG_VALUE_2] & 0x0000FFFF) << 3;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh =
	    (uint16_t) (args->args[ARG_VALUE_2] >> 13) & 0x0000FFFF;
	CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);
	createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0, NULL);
	break;

    case PARAM_BUS_CanFilterReset:	/* 11bit CAN filter mask ID reconfig */
	for (i = 0; i < 14; i++) {
	    CAN_FilterInitStructure.CAN_FilterNumber = i;
	    CAN_FilterInitStructure.CAN_FilterIdLow = 0x000 << 5;
	    CAN_FilterInitStructure.CAN_FilterIdHigh = 0x000 << 5;
	    CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x07FF << 5;
	    CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x07FF << 5;
	    CAN_FilterInitStructure.CAN_FilterScale =
		CAN_FilterScale_16bit;
	    CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	    CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	    CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	    CAN_FilterInit(&CAN_FilterInitStructure);
	}
	createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0, NULL);
	break;

    default:
	createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_OS_UNKNOWN_COMMAND,
			       0, ERR_CODE_OS_UNKNOWN_COMMAND_TEXT);
	break;
    }

    return pdPASS;
}

/*----------------------------------------------------------------------------*/

void bus_close_can()
{
    NVIC_InitTypeDef NVIC_InitStructure;

    reportReceivedData = NULL;

    /* Disable CAN1 Receive interrupt generally */
    NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Disable CAN1 Receive interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = USB_HP_CAN1_TX_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Disable CAN1 Receive error interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = CAN1_SCE_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);
}

/*----------------------------------------------------------------------------*/

UBaseType_t busControl(UBaseType_t cmd, void *param)
{
    switch (cmd) {
    case ODB_CMD_RECV:
	reportReceivedData = param;
	return pdPASS;
	break;
    default:
	return pdFAIL;
	break;
    }
    return pdFAIL;
}

/*----------------------------------------------------------------------------*/
void USB_LP_CAN1_RX0_IRQHandler(void)
{
    DEBUGUARTPRINT("\r\n*** USB_LP_CAN1_RX0_IRQHandler entered ***");
//    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
    uint8_t i;
    uint16_t LedDuration;
    CanRxMsg RxMessage;
    static data_packet dp;
	
    /* initialize RxMessage CAN frame */
    RxMessage.StdId = 0x00;
    RxMessage.ExtId = 0x00;
    RxMessage.IDE = CAN_ID_STD;
    RxMessage.DLC = 0;
    RxMessage.FMI = 0;
    for (i = 0; i < 8; i++) {
	RxMessage.Data[i] = 0x00;
    }

    CAN_Receive(CAN1, CAN_FIFO0, &RxMessage);

    if (RxMessage.StdId != 0 || RxMessage.ExtId != 0) {
	rxCount++;		/* increment counter for valid received CAN message */
	if (rxCount > 100000) {
	    rxCount /= 2;
	    txCount /= 2;
	    errCount /= 2;
	}

