stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/mc_can.c
	/* Data received. Process it. */
	if (RxMessage.IDE == CAN_ID_STD) {
	    dp.recv = RxMessage.StdId;		/* Standard CAN frame 11bit received */
		dp.recv &= ~0x80000000;			/* set Bit 31=0 for Extended CAN identifier 29 bit */
	}
	else {
	    dp.recv = RxMessage.ExtId;		/* Extended CAN frame 29bit received */
		dp.recv |= 0x80000000;			/* set Bit 31=1 for Extended CAN identifier 29 bit */
	}
	/* CAN-Frame values which are independent on standard or extended identifiers */
	dp.len = RxMessage.DLC;
	
	if (CAN_MessagePending(CAN1, CAN_FIFO0) == 0x00)
		dp.err = 0x00;		/* use received value for error simulations */
	else
		dp.err = 0x01;		/* set error flag indication if CAN message is pending */
	dp.data = &RxMessage.Data[0];	/* data starts here */
	if (reportReceivedData)
	    reportReceivedData(&dp,pdTRUE);
    }
    DEBUGUARTPRINT("\r\n*** USB_LP_CAN1_RX0_IRQHandler finished ***");
	
//    portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
}

/*----------------------------------------------------------------------------*/
void CAN1_SCE_IRQHandler(void)
{
    DEBUGUARTPRINT("\r\n*** CAN1_SCE_IRQHandler entered ***");
//    UBaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* check for receive errors */
    if (CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_StuffErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_FormErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_ACKErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_BitRecessiveErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_BitDominantErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_CRCErr)
	errCount++;		// increment err Counter if CAN error occurs

    /* clear all interrupt Flags */
    CAN_ClearITPendingBit(CAN1, CAN_IT_ERR);
    CAN_ClearITPendingBit(CAN1, CAN_IT_LEC);
    CAN_ClearITPendingBit(CAN1, CAN_IT_BOF);
    CAN_ClearITPendingBit(CAN1, CAN_IT_EPV);
    CAN_ClearITPendingBit(CAN1, CAN_IT_EWG);

    DEBUGUARTPRINT("\r\n*** CAN1_SCE_IRQHandler finished ***");
}

/*----------------------------------------------------------------------------*/
void USB_HP_CAN1_TX_IRQHandler(void)
{
    DEBUGUARTPRINT("\r\n*** USB_HP_CAN1_TX_IRQHandler entered ***");

    txCount++;			// increment CAN-Tx Counter if interrupt occurs
    if (txCount > 100000) {
	rxCount /= 2;
	txCount /= 2;
	errCount /= 2;
    }

    /* clear Tranmit interrupt flag */
    CAN_ClearITPendingBit(CAN1, CAN_IT_TME);

    DEBUGUARTPRINT("\r\n*** CAN1_SCE_IRQHandler finished ***");
}

/*----------------------------------------------------------------------------*/

UBaseType_t bus_rx_error_can()
{
    return errCount;
}

/*----------------------------------------------------------------------------*/

UBaseType_t bus_tx_error_can()
{
    return 0;
}

/*----------------------------------------------------------------------------*/

void bus_clear_rx_error_can()
{
    errCount = 0;
}

/*----------------------------------------------------------------------------*/

void bus_clear_tx_error_can()
{
}

/*----------------------------------------------------------------------------*/

UBaseType_t bus_rx_count_can()
{
    return rxCount;
}

/*----------------------------------------------------------------------------*/

UBaseType_t bus_tx_count_can()
{
    return txCount;
}

/*----------------------------------------------------------------------------*/

void bus_clear_rx_count_can()
{
    rxCount = 0;
}

/*----------------------------------------------------------------------------*/

void bus_clear_tx_count_can()
{
    txCount = 0;
}

UBaseType_t bus_busoff_error_can()
{
    /* check for Bus-off flag */
    stCANBusOffErr = CAN_GetFlagStatus(CAN1, CAN_FLAG_BOF);
    return stCANBusOffErr;
}

UBaseType_t bus_passive_error_can()
{
    /* check for Error passive flag */
    stCANBusPassiveErr = CAN_GetFlagStatus(CAN1, CAN_FLAG_EPV);
    return stCANBusPassiveErr;
}

UBaseType_t bus_warning_error_can()
{
    /* check for Error Warning flag */
    stCANBusWarningErr = CAN_GetFlagStatus(CAN1, CAN_FLAG_EWG);
    return stCANBusWarningErr;
}

UBaseType_t bus_tec_can()
{
    /* read Transmit Error Counter of CAN hardware */
    ctrCANTec = CAN_GetLSBTransmitErrorCounter(CAN1);
    return ctrCANTec;
}

UBaseType_t bus_rec_can()
{
    /* read Receive Error Counter of CAN hardware */
    ctrCANRec = CAN_GetReceiveErrorCounter(CAN1);
    return ctrCANRec;
}
